amass
aom
aribb24
autoconf
automake
azure-cli
bat
bdw-gc
bison
brotli
byobu
ca-certificates
cairo
cask
ccat
certifi
chruby
cjson
cmake
coreutils
cowsay
cscope
csvprintf
dav1d
docker
docker-completion
duf
emacs
exif
exiftool
ffmpeg
figlet
flac
fontconfig
freetype
frei0r
fribidi
gcc
gdbm
gettext
ghostscript
giflib
git
glib
gmp
gnutls
go
go-passbolt-cli
graphite2
grep
harfbuzz
helm
hexedit
highway
htop
httpie
icu4c@75
icu4c@76
imagemagick
imath
ipcalc
ipython
isl
jansson
jasper
jbig2dec
jpeg-turbo
jpeg-xl
jq
lame
leptonica
libarchive
libass
libb2
libbluray
libde265
libdeflate
libevent
libexif
libffi
libgit2
libheif
libidn
libidn2
liblinear
liblqr
libmicrohttpd
libmpc
libnghttp2
libogg
libomp
libpng
libraw
librist
libsamplerate
libsndfile
libsodium
libsoxr
libssh
libssh2
libtasn1
libtiff
libtool
libunibreak
libunistring
libusb
libvidstab
libvmaf
libvorbis
libvpx
libx11
libxau
libxcb
libxdmcp
libxext
libxrender
libyaml
little-cms2
lua
lynx
lz4
lzo
m4
macvim
masscan
mbedtls
mpdecimal
mpfr
mpg123
mtr
nasm
ncurses
nethogs
nettle
newt
nikto
nmap
nyancat
oniguruma
opencore-amr
openexr
openjpeg
openrtsp
openssl@1.1
openssl@3
opus
p11-kit
pandoc
pango
pastebinit
pcre2
pipx
pixman
popt
pstree
python-certifi
python-packaging
python-setuptools
python@3.10
python@3.12
python@3.13
python@3.9
rav1e
readline
rubberband
ruby
ruby-install
rustup
rustup-init
s-lang
sdl2
sevenzip
shared-mime-info
snappy
speedtest-cli
speex
sqlite
srt
sshuttle
sstp-client
svt-av1
tcpflow
telnet
terraform
tesseract
testdisk
theora
tmux
tree-sitter
unbound
utf8proc
w3m
webp
wget
wimlib
x264
x265
xorgproto
xvid
xz
youtube-dl
zeromq
zimg
zstd
choosy
netiquette
powershell
rectangle
transmission
wireshark
