tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "passbolt/tap"
brew "amass"
brew "automake"
brew "libyaml"
brew "openssl@3"
brew "readline"
brew "azure-cli"
brew "bat"
brew "bison"
brew "python@3.13"
brew "tmux"
brew "byobu"
brew "cask"
brew "ccat"
brew "certifi"
brew "chruby"
brew "cmake"
brew "cowsay"
brew "csvprintf"
brew "docker"
brew "duf"
brew "exif"
brew "exiftool"
brew "icu4c@76"
brew "ffmpeg"
brew "figlet"
brew "gcc"
brew "gdbm"
brew "ghostscript"
brew "git"
brew "go"
brew "grep"
brew "helm"
brew "hexedit"
brew "htop"
brew "httpie"
brew "libheif"
brew "imagemagick"
brew "ipcalc"
brew "ipython"
brew "jq"
brew "libffi"
brew "libusb"
brew "lynx"
brew "ruby"
brew "macvim"
brew "masscan"
brew "mtr"
brew "nasm"
brew "nethogs"
brew "nikto"
brew "nmap"
brew "nyancat"
brew "openrtsp"
brew "openssl@1.1"
brew "pandoc"
brew "pastebinit"
brew "pipx"
brew "pstree"
brew "python-setuptools"
brew "python@3.9"
brew "ruby-install"
brew "rustup"
brew "sevenzip"
brew "speedtest-cli"
brew "sshuttle"
brew "sstp-client"
brew "tcpflow"
brew "telnet"
brew "testdisk"
brew "w3m"
brew "wget"
brew "wimlib"
brew "youtube-dl"
brew "hashicorp/tap/terraform"
brew "passbolt/tap/go-passbolt-cli"
cask "choosy"
cask "netiquette"
cask "powershell"
cask "rectangle"
cask "transmission"
cask "wireshark"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.powershell"
vscode "redhat.vscode-yaml"
