{"name":"echomunge","version":"0.2.0","description":"Collect text and echo back out text with similar patterns. Pure silliness with no practical purpose.","main":"index.js","bin":{"echomunge":"./fsmunge"},"repository":{"type":"git","url":"https://github.com/rvagg/node-echomunge.git"},"keywords":["silly","munge"],"authors":["Rod Vagg @rvagg <rod@vagg.org> (https://github.com/rvagg)"],"license":"MIT","readme":"# EchoMunge\n\nCollect text and echo back out text with similar patterns. Pure silliness with no practical purpose. A little like Chinese Whispers but not really.\n\nFor Node.js, you'll find EchoMunge in npm as *echomunge*.\n\nSee also [EchoMunge-Web](https://github.com/rvagg/node-echomunge-web) for an extension that will munge Wikipedia and other web pages for you.\n\n### Example\n\n```js\nvar EchoMunge = require('echomunge')\n  , db = new EchoMunge()\n  , fs = require('fs')\n  , body = fs.readFileSync('star_wars_a_new_hope.txt', 'utf8')\n\ndb.recordText(body)\nfor (var i = 0; i < 100; i++)\n  console.log(db.makeText({ maxLength: 500, terminate: true }))\n```\n\nAnd you might get something like this:\n\n > Fighter's above you, motherly woman, fills a pitcher with blue fluid from his shoulder at Luke as the pirateship makes the jump into hyperspace isn't worth the effort.\n > \n > Well, I can't see his identification?\n > \n > Threepio intercedes on behalf of laserbolts at the vast Imperial fighters?\n > \n > Then everything is quiet for a few feet of Luke's voice over the surface and into space dust?\n > \n > Enemy fighters flying in formation down the main reactor system will dare oppose the best star-pilot in white, the Force if enemy ships are near Han.\n > \n > What I make the computer screen.\n > \n > IMPERIAL STARDESTROYER?\n > \n > Not likely.\n > \n > Out of its mechanical arms bearing a transport that the TIE ships dive on from the right moment.\n > \n > Men, monsters, who zaps him with that one thing straight up in range in five minutes to lock it down.\n > \n > Even I see that.\n > \n > Aghast, hard, bear-like creatures are done?\n > \n > WINGMAN'S COCKPIT: DODONNA: The Jedi his power!\n\n**OR** you could use the bundled executable that you'll get if you `npm install echomunge -g` to do the same thing:\n\n```sh\n$ echomunge star_wars_a_new_hope.txt 100\n```\n\n## API\n\n### EchoMunge\n\n```js\nvar db = new EchoMunge()\n```\n\nCreate a new \"database\" instance to store words, calculate connection probabilities and generate text from the data.\n\n```js\ndb.recordText(text)\n```\n\nProcess a slab of text. Store the words and calculation connection probabilities. You can call this as many times as you like with different slabs of text, of any length, at any time, and the results will be aggregated.\n\n```js\ndb.makeText([options])\n```\n\nGenerate some text that sounds vaguely like the text that has been processed thus far. Available options are: `maxLength` - the maximum number of characters for the output (number, default `300`), and `terminate` - ensure all generated text is terminated properly (boolean, default `false`).\n\nThere's potential for a lot more options to tweak the behaviour, if you want to have a go at exposing them then good luck with that!\n\n## Licence\n\nEchoMunge is Copyright (c) 2012 Rod Vagg [@rvagg](https://twitter.com/rvagg) and licenced under the MIT licence. All rights not explicitly granted in the MIT license are reserved. See the included LICENSE file for more details.","readmeFilename":"README.md","bugs":{"url":"https://github.com/rvagg/node-echomunge/issues"},"_id":"echomunge@0.2.0","dist":{"shasum":"2ca7542e5d15cbb785fed0c76573e7e22de86145","tarball":"http://registry.npmjs.org/echomunge/-/echomunge-0.2.0.tgz"},"_from":".","_npmVersion":"1.3.8","_npmUser":{"name":"rvagg","email":"rod@vagg.org"},"maintainers":[{"name":"rvagg","email":"rod@vagg.org"}],"directories":{},"_etag":"\"CST81K12JQDN44VFOL4LFD4YM\""}